# Считываю целое число от пользователя
n = int(input("Введите целое число: "))
# Проверяю, чтобы число соответствовало условию задачи (от 1 до 100 000 включительно)
if n < 1 or n > 100000:
    print("Введено некорректное число")
else:
    # Создаю счетчик операций
    operations = 0
    # Запускаю цикл, пока число n не уменьшится до 0
    while n > 0:
        # Проверяю, делится ли число на 3 без остатка
        if n % 3 == 0:
            n = n - 3   # Если делится, вычитаю 3
        else:
            n = n - 1   # В остальных случаях просто уменьшаю число на 1
        # Увеличиваю счетчик операций после каждого действия
        operations = operations + 1
    # Вывожу итоговое количество выполненных операций
    print("Количество операций: ", operations)